pro_tips/app/views/application/_user_card.html.erb

SELECT  "tips".* FROM "tips" WHERE "tips"."user_id" = ? ORDER BY "tips"."id" DESC LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "tips" WHERE "tips"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  <div class="card-body">
    <% if user.tips.any? %>