pro_tips/app/controllers/home_controller.rb

  def index
    @tips = Tip.order(updated_at: :desc).limit(4)
---
SELECT  "tips".* FROM "tips" ORDER BY "tips"."updated_at" DESC LIMIT ?  [["LIMIT", 4]]