pro_tips/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "florian@extensionschool.ch"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:email].downcase)