app/controllers/tips_controller.rb

SELECT  "tips".* FROM "tips" WHERE ((title LIKE '%%') OR (body LIKE '%%')) LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tips" WHERE ((title LIKE '%%') OR (body LIKE '%%'))
---
  def index
    @search_term = params[:q]
    @tips = Tip.search(@search_term).page(params[:page])

SELECT  "tips".* FROM "tips" WHERE "tips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_tip
      @tip = Tip.find(params[:id])