app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
---
  def index
    @users = User.all.page(params[:page])

UPDATE "users" SET "avatar_url" = ?, "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_url", "/uploads/user/avatar/1/PNG_image_5.png"], ["avatar", "UC-374d90a2-f3f5-44dc-b07c-792b387b57de.jpg"], ["updated_at", "2020-11-13 10:12:47.193009"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(edit_user_params)